11/data/attachments/1373aea681479ea0.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_d4e43edc-1488-4b36-8a6f-330fa0bcc560</nif:username>
            <nif:friendToBeAdded>Ian_especially_Actions_30833_0</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>